uhnp/src/Enums/НаправленияРаспознанногоДокумента/НаправленияРаспознанногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияРаспознанногоДокумента</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыДокументовРаспознаваниеДокументов/ТипыДокументовРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовРаспознаваниеДокументов</name>
  <enumValues>
    <name>АктОбОказанииУслуг</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>НеопределенныйДокумент</name>
    <comment>Форма документа</comment>
  </enumValues>
  <enumValues>
    <name>КассовыйЧек</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЯвляетсяОбъектомЦБ</name>
    <comment>Выполнение задач №000042800</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_РаботаетСЭД</name>
    <comment>// Шичкин Егор 15.12.2022 Выполнение задач №000043264</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_Контрагент</name>
    <comment>//Блинова М.А. 14.11.2024 Выполнение задач №000051645</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/СтраныМира/СтраныМира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраныМира</name>
  <predefined>
    <items>
      <name>Россия</name>
      <description>РОССИЯ</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЕАЭС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/РаспознаваниеДокументовКлиентПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Открытие формы создаваемого документа.
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовРаспознаваниеДокументов
//  ПараметрыЗаполнения - Структура:
//  *Контрагент - СправочникСсылка.Контрагенты
//  *Организация - СправочникСсылка.Организации
//  *ИмяРеквизитаНомерДокумента - Строка
//  *ИмяРеквизитаДатаДокумента  - Строка 
//  Владелец - Форма
//
Процедура ОткрытиеФормыСоздаваемогоДокумента(ТипДокумента, ПараметрыЗаполнения, Владелец) Экспорт
	
	РаспознаваниеДокументовУПКлиент.ОткрытиеФормыСоздаваемогоДокумента(ТипДокумента, ПараметрыЗаполнения, Владелец);

КонецПроцедуры

// Открытие формы редактирования строки.
// 
// Параметры:
//  ЭтотОбъект - Форма 
//  ДанныеСтроки - СтрокаТабличнойЧасти
//
Процедура ОткрытиеФормыРедактированияСтроки(ЭтотОбъект, ДанныеСтроки) Экспорт
		
КонецПроцедуры

Процедура ИмяФормыСозданияЭлемента(ИмяЭлемента, ИмяФормы, ПараметрыОткрытия) Экспорт	
	
	Направление = ПараметрыОткрытия.Направление;
	ТипДокумента = ПараметрыОткрытия.ТипДокумента;
	НаборДанных = ПараметрыОткрытия.НаборДанных;
	ДополнительныеДанные = ПараметрыОткрытия.ДополнительныеДанные;
	
	Если ИмяЭлемента = "Партнер" Тогда
		
		ПараметрыОткрытия.Вставить("Основание", Новый Структура());

		Если (Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий")
		И Не ЗначениеЗаполнено(НаборДанных.Получить("Покупатель").Значение)) Или 
		(Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий")
		И Не ЗначениеЗаполнено(НаборДанных.Получить("Продавец").Значение))Тогда
			Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД") 
				Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда 
					ИННКонтрагента = ДополнительныеДанные.ИННКонтрагента;
					КППКонтрагента = ДополнительныеДанные.КППКонтрагента;
			ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг") Тогда 
				Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
					ИННКонтрагента = НаборДанных.Получить("ИННПокупателя").Значение;
				Иначе
					ИННКонтрагента = НаборДанных.Получить("ИННПродавца").Значение;
				КонецЕсли;
			Иначе
				Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
					ИННКонтрагента = НаборДанных.Получить("ИННПокупателя").Значение;
					КППКонтрагента = НаборДанных.Получить("КПППокупателя").Значение;
				Иначе
					ИННКонтрагента = НаборДанных.Получить("ИННПродавца").Значение;
					КППКонтрагента = НаборДанных.Получить("КПППродавца").Значение;
				КонецЕсли;
			КонецЕсли;
			ПараметрыОткрытия.Основание.Вставить("ИНН",ИННКонтрагента);
			ПараметрыОткрытия.Основание.Вставить("КПП",КППКонтрагента);  
			ПараметрыОткрытия.Основание.Вставить("ЮридическийАдрес");
		КонецЕсли;
		
		Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
			ТекстЗаполнения = НаборДанных.Получить("Покупатель").РаспознанныйТекст;
			Вид = "Клиент";
		Иначе
			ТекстЗаполнения = НаборДанных.Получить("Продавец").РаспознанныйТекст;
			Вид = "Поставщик";
		КонецЕсли;

		ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Структура());
		ПараметрыОткрытия.ПараметрыВыбора.Вставить(Вид, Истина);
		ПараметрыОткрытия.Основание.Вставить("СокращенноеНаименование", ТекстЗаполнения);
		ПараметрыОткрытия.Основание.Вставить("Наименование", ТекстЗаполнения);
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового";
		
	ИначеЕсли ИмяЭлемента = "Покупатель" Или ИмяЭлемента = "Продавец" Тогда
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД") 
			Или ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда 
				ИННКонтрагента = ДополнительныеДанные.ИННКонтрагента;
				КППКонтрагента = ДополнительныеДанные.КППКонтрагента;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг") Тогда 
			Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
				ИННКонтрагента = НаборДанных.Получить("ИННПокупателя").Значение;
			Иначе
				ИННКонтрагента = НаборДанных.Получить("ИННПродавца").Значение;
			КонецЕсли;
		Иначе
			Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
				ИННКонтрагента = НаборДанных.Получить("ИННПокупателя").Значение;
				КППКонтрагента = НаборДанных.Получить("КПППокупателя").Значение;
			Иначе
				ИННКонтрагента = НаборДанных.Получить("ИННПродавца").Значение;
				КППКонтрагента = НаборДанных.Получить("КПППродавца").Значение;
			КонецЕсли;
		КонецЕсли;

		Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
			ТекстЗаполнения = НаборДанных.Получить("Покупатель").РаспознанныйТекст;
			Вид = "Клиент";
		Иначе
			ТекстЗаполнения = НаборДанных.Получить("Продавец").РаспознанныйТекст;
			Вид = "Поставщик";
		КонецЕсли;

		Если ДополнительныеДанные.ИспользоватьПартнеровИКонтрагентов Тогда
			Партнер = НаборДанных.Получить("Партнер").Значение;
			Если ЗначениеЗаполнено(Партнер) Тогда
				ЗначенияЗаполнения = Новый Структура("Партнер", Партнер);
			    ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			Иначе
				ЗначенияЗаполнения = Новый Структура("НаименованиеПолное", ТекстЗаполнения);
			    ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			КонецЕсли;
			ЗначенияЗаполнения.Вставить("ИНН",ИННКонтрагента);
			ЗначенияЗаполнения.Вставить("КПП",КППКонтрагента);
			ПараметрыОткрытия.Вставить("ТекстЗаполнения", ТекстЗаполнения);
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
			ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента";
		Иначе
			ПараметрыОткрытия.Вставить("Основание", Новый Структура());
			ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Структура());
			ПараметрыОткрытия.ПараметрыВыбора.Вставить(Вид, Истина);
			ПараметрыОткрытия.Основание.Вставить("ИНН",ИННКонтрагента);
			ПараметрыОткрытия.Основание.Вставить("КПП",КППКонтрагента);
			ПараметрыОткрытия.Основание.Вставить("СокращенноеНаименование", ТекстЗаполнения);
			ПараметрыОткрытия.Основание.Вставить("Наименование", ТекстЗаполнения);
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
			ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового";
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "Грузоотправитель" Или ИмяЭлемента = "Грузополучатель" Тогда
		
		Если ИмяЭлемента = "Грузоотправитель" Тогда
			ТекстЗаполнения = НаборДанных.Получить("Грузоотправитель").РаспознанныйТекст;
		Иначе
			ТекстЗаполнения = НаборДанных.Получить("Грузополучатель").РаспознанныйТекст;
		КонецЕсли;  
		
		Если ДополнительныеДанные.ИспользоватьПартнеровИКонтрагентов Тогда
			ПараметрыОткрытия.Вставить("ТекстЗаполнения", ТекстЗаполнения);
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
			ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента";
		Иначе    
			ПараметрыОткрытия.Вставить("Основание", Новый Структура());
			ПараметрыОткрытия.Основание.Вставить("СокращенноеНаименование", ТекстЗаполнения);
			ПараметрыОткрытия.Основание.Вставить("Наименование", ТекстЗаполнения);
			ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
			ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового";
		КонецЕсли;
			
	ИначеЕсли ИмяЭлемента = "Договор" Тогда
		Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
			Организация = НаборДанных.Получить("ПродавецОрганизация").Значение;
			Контрагент = НаборДанных.Получить("Покупатель").Значение;
			ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
		Иначе
			Организация = НаборДанных.Получить("ПокупательОрганизация").Значение;
			Контрагент = НаборДанных.Получить("Продавец").Значение;
			ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
		КонецЕсли;
		ЗначенияЗаполнения = Новый Структура("Организация", Организация);
		ЗначенияЗаполнения.Вставить("Контрагент",Контрагент);
		ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация",ХозяйственнаяОперация);
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);   
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента";		
		
	ИначеЕсли ИмяЭлемента = "Номенклатура" Тогда 
		ПараметрыОткрытия.Вставить("ДополнительныеПараметры", Новый Структура());
		ПараметрыОткрытия.Вставить("ТекстЗаполнения",НаборДанных.Получить("Номенклатура").РаспознанныйТекст);
		ПараметрыОткрытия.ДополнительныеПараметры.Вставить("Артикул",НаборДанных.Получить("Артикул").Значение); 
		ПараметрыОткрытия.ДополнительныеПараметры.Вставить("ЕдиницаИзмерения",НаборДанных.Получить("ЕдиницаИзмерения").Значение);
		ПараметрыОткрытия.ДополнительныеПараметры.Вставить("СтавкаНДС",НаборДанных.Получить("СтавкаНДС").Значение);
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Структура("ТипНоменклатуры", 
			ДополнительныеДанные.ПараметрыВыбораНоменклатуры));
		ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"; 
		
	ИначеЕсли ИмяЭлемента = "БанковскийСчетКонтрагента" Или ИмяЭлемента = "БанковскийСчетОрганизации" Тогда 
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);	
		Если ИмяЭлемента = "БанковскийСчетКонтрагента" Тогда 
			ИмяФормы = "Справочник.БанковскиеСчетаКонтрагентов.Форма.ФормаЭлемента";
		Иначе
			Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
				Организация = НаборДанных.Получить("ПродавецОрганизация").Значение;
			Иначе
				Организация = НаборДанных.Получить("ПокупательОрганизация").Значение;
			КонецЕсли;
			ЗначенияЗаполнения = Новый Структура("Владелец", Организация);
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ИмяФормы = "Справочник.БанковскиеСчетаОрганизаций.Форма.ФормаЭлемента";
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "СтранаПроисхождения" Тогда 
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ЗначенияЗаполнения = Новый Структура("НаименованиеПолное", НаборДанных.Получить("СтранаПроисхождения").РаспознанныйТекст);
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ИмяФормы = "Справочник.СтраныМира.Форма.ФормаЭлемента";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
